Try to find correlation between district financing and district graduation rate

In [1]:
import pandas as pd
import numpy as np

In [2]:
#oped the data frame ()
df= pd.read_csv("Sources/All_NO_1617.csv")
df

,Year,CDS_CODE,ETHNIC,GR_12,ENR_TOTAL,GRADS,UC_GRADS,District_Code,Function_Code,Function,Amount
0,1213,1100170000000,0,2,35,3,1,10017,2100,Classified Instructional Salaries ...,5761988.84
1,1213,1100170000000,0,2,35,3,1,10017,5900,Communications ...,2126900.99
2,1213,1100170000000,0,2,35,3,1,10017,7110,Tuition for Instruction Under Interdistrict At...,248316.29
3,1213,1100170000000,0,2,35,3,1,10017,8110,Maintenance and Operations (Public Law 81-874)...,2607.78
4,1213,1100170000000,0,2,35,3,1,10017,9200,Accounts Receivable ...,1138122.98
...,...,...,...,...,...,...,...,...,...,...,...
11905,1516,57727100000000,7,194,2328,178,85,72710,7110,Tuition for Instruction Under Interdistrict At...,112978.33
11906,1516,57727100000000,7,194,2328,178,85,72710,9200,Accounts Receivable ...,1070796.00
11907,1516,57727100000000,9,5,141,5,3,72710,4200,Books and Other Reference Materials ...,549355.85
11908,1516,57727100000000,9,5,141,5,3,72710,7110,Tuition for Instruction Under Interdistrict At...,112978.33
11909,1516,57727100000000,9,5,141,5,3,72710,9200,Accounts Receivable ...,1070796.00

In [3]:
df.Amount.min()

32.83

In [5]:
#Remove last seven digit that show the school
df['CDS_CODE'] = df['CDS_CODE'].astype(str).str[:-7].astype(np.int64)
df

,Year,CDS_CODE,ETHNIC,GR_12,ENR_TOTAL,GRADS,UC_GRADS,District_Code,Function_Code,Function,Amount
0,1213,110017,0,2,35,3,1,10017,2100,Classified Instructional Salaries ...,5761988.84
1,1213,110017,0,2,35,3,1,10017,5900,Communications ...,2126900.99
2,1213,110017,0,2,35,3,1,10017,7110,Tuition for Instruction Under Interdistrict At...,248316.29
3,1213,110017,0,2,35,3,1,10017,8110,Maintenance and Operations (Public Law 81-874)...,2607.78
4,1213,110017,0,2,35,3,1,10017,9200,Accounts Receivable ...,1138122.98
...,...,...,...,...,...,...,...,...,...,...,...
11905,1516,5772710,7,194,2328,178,85,72710,7110,Tuition for Instruction Under Interdistrict At...,112978.33
11906,1516,5772710,7,194,2328,178,85,72710,9200,Accounts Receivable ...,1070796.00
11907,1516,5772710,9,5,141,5,3,72710,4200,Books and Other Reference Materials ...,549355.85
11908,1516,5772710,9,5,141,5,3,72710,7110,Tuition for Instruction Under Interdistrict At...,112978.33
11909,1516,5772710,9,5,141,5,3,72710,9200,Accounts Receivable ...,1070796.00

In [6]:
#Keep last five digits that show the district
df['CDS_CODE'] = df['CDS_CODE'].astype(str).str[:5].astype(np.int64)
df

,Year,CDS_CODE,ETHNIC,GR_12,ENR_TOTAL,GRADS,UC_GRADS,District_Code,Function_Code,Function,Amount
0,1213,11001,0,2,35,3,1,10017,2100,Classified Instructional Salaries ...,5761988.84
1,1213,11001,0,2,35,3,1,10017,5900,Communications ...,2126900.99
2,1213,11001,0,2,35,3,1,10017,7110,Tuition for Instruction Under Interdistrict At...,248316.29
3,1213,11001,0,2,35,3,1,10017,8110,Maintenance and Operations (Public Law 81-874)...,2607.78
4,1213,11001,0,2,35,3,1,10017,9200,Accounts Receivable ...,1138122.98
...,...,...,...,...,...,...,...,...,...,...,...
11905,1516,57727,7,194,2328,178,85,72710,7110,Tuition for Instruction Under Interdistrict At...,112978.33
11906,1516,57727,7,194,2328,178,85,72710,9200,Accounts Receivable ...,1070796.00
11907,1516,57727,9,5,141,5,3,72710,4200,Books and Other Reference Materials ...,549355.85
11908,1516,57727,9,5,141,5,3,72710,7110,Tuition for Instruction Under Interdistrict At...,112978.33
11909,1516,57727,9,5,141,5,3,72710,9200,Accounts Receivable ...,1070796.00

In [7]:
#Drop Function variable
df = df.drop(columns=['Function'])
df

,Year,CDS_CODE,ETHNIC,GR_12,ENR_TOTAL,GRADS,UC_GRADS,District_Code,Function_Code,Amount
0,1213,11001,0,2,35,3,1,10017,2100,5761988.84
1,1213,11001,0,2,35,3,1,10017,5900,2126900.99
2,1213,11001,0,2,35,3,1,10017,7110,248316.29
3,1213,11001,0,2,35,3,1,10017,8110,2607.78
4,1213,11001,0,2,35,3,1,10017,9200,1138122.98
...,...,...,...,...,...,...,...,...,...,...
11905,1516,57727,7,194,2328,178,85,72710,7110,112978.33
11906,1516,57727,7,194,2328,178,85,72710,9200,1070796.00
11907,1516,57727,9,5,141,5,3,72710,4200,549355.85
11908,1516,57727,9,5,141,5,3,72710,7110,112978.33
11909,1516,57727,9,5,141,5,3,72710,9200,1070796.00

In [8]:
#Group data by district
df =df.groupby(["CDS_CODE", "Year"]).sum()
df.head()

               ETHNIC  GR_12  ENR_TOTAL  GRADS  UC_GRADS  District_Code  \
CDS_CODE Year
10623    1213       5     64        496      1         0          62380
         1314      20    193        754     33         0         311900
         1415      20    288        872     73         0         311900
         1516      48    618       1752    280        68         748560
10624    1213     120   2105      32095   1930       700        1560750

               Function_Code       Amount
CDS_CODE Year
10623    1213           7110     72191.81
         1314          35550    431693.15
         1415          35550    175536.15
         1516          67860    508728.60
10624    1213         153100  30334669.40

In [9]:
#Reset index
df = df.reset_index()
df

,CDS_CODE,Year,ETHNIC,GR_12,ENR_TOTAL,GRADS,UC_GRADS,District_Code,Function_Code,Amount
0,10623,1213,5,64,496,1,0,62380,7110,72191.81
1,10623,1314,20,193,754,33,0,311900,35550,431693.15
2,10623,1415,20,288,872,73,0,311900,35550,175536.15
3,10623,1516,48,618,1752,280,68,748560,67860,508728.60
4,10624,1213,120,2105,32095,1930,700,1560750,153100,30334669.40
...,...,...,...,...,...,...,...,...,...,...
412,96190,1516,170,1445,7755,1300,370,2476120,206480,31571949.84
413,97378,1213,72,528,3228,508,108,1475660,118050,11619427.40
414,97378,1314,100,536,3152,516,96,1770792,141660,15155083.38
415,97378,1415,104,484,2952,452,96,1475660,118050,11921986.85
416,97378,1516,145,495,3565,425,130,1844575,147550,11444739.40

In [10]:
#Calculate Graduation rate
df['GR_RATE'] = df.UC_GRADS/df.GR_12
df

,CDS_CODE,Year,ETHNIC,GR_12,ENR_TOTAL,GRADS,UC_GRADS,District_Code,Function_Code,Amount,GR_RATE
0,10623,1213,5,64,496,1,0,62380,7110,72191.81,0.000000
1,10623,1314,20,193,754,33,0,311900,35550,431693.15,0.000000
2,10623,1415,20,288,872,73,0,311900,35550,175536.15,0.000000
3,10623,1516,48,618,1752,280,68,748560,67860,508728.60,0.110032
4,10624,1213,120,2105,32095,1930,700,1560750,153100,30334669.40,0.332542
...,...,...,...,...,...,...,...,...,...,...,...
412,96190,1516,170,1445,7755,1300,370,2476120,206480,31571949.84,0.256055
413,97378,1213,72,528,3228,508,108,1475660,118050,11619427.40,0.204545
414,97378,1314,100,536,3152,516,96,1770792,141660,15155083.38,0.179104
415,97378,1415,104,484,2952,452,96,1475660,118050,11921986.85,0.198347
416,97378,1516,145,495,3565,425,130,1844575,147550,11444739.40,0.262626

In [11]:
financing = df["Amount"]
grad_rate = df["GR_RATE"]
correlation = financing.corr(grad_rate)
correlation

0.21613950002508017